#==================================================================================================================

# Функция ord() позволяет определить код некоторого символа в таблице символов Unicode. 
# Аргументом данной функции является одиночный символ.
num1 = ord('A')
num2 = ord('B')
num3 = ord('a') 
print(num1, num2, num3)
# выводит:
# 65 66 97

#==================================================================================================================

# Функция chr() позволяет определить по коду символа сам символ. Аргументом данной функции является численный код.
chr1 = chr(65)
chr2 = chr(75)
chr3 = chr(110)
print(chr1, chr2, chr3)
# выводит:
# A K n

for i in range(26):
    print(chr(ord('A') + i))
# Приведённый выше код выводит:
#A
#B
#C
...
#X
#Y
#Z
