
#==================================================================================================================


# Метод split() разбивает строку на слова, используя в качестве разделителя последовательность пробельных символов, 
# и возвращает список из этих слов.

s = 'Python is the most powerful language'
words = s.split()

print(words)

#выводит:
['Python', 'is', 'the', 'most', 'powerful', 'language']

# Приведённый ниже код:

numbers = input().split()
for i in range(len(numbers)):
    numbers[i] = int(numbers[i])
print(numbers)

# выводит (если на вход программе была подана строка 1 2 3 4 5):
[1, 2, 3, 4, 5]

# необязательный параметр

ip = '192.168.1.24'
numbers = ip.split('.')    # явно указываем разделитель
print(numbers)
               
# выводит:
['192', '168', '1', '24']


#==================================================================================================================


# Метод join() собирает строку из элементов списка, используя в качестве разделителя строку, 
# к которой применяется метод.

words = ['Python', 'is', 'the', 'most', 'powerful', 'language']
s = ' '.join(words)
print(s)
               
# выводит:
# Python is the most powerful language

words = ['Мы', 'учим', 'язык', 'Python']
print('*'.join(words))
print('-'.join(words))
print('?'.join(words))
print('!'.join(words))
print('*****'.join(words))
print('abc'.join(words))
print('123'.join(words))

# Приведённый выше код выводит:
# Мы*учим*язык*Python
# Мы-учим-язык-Python
# Мы?учим?язык?Python
# Мы!учим!язык!Python
# Мы*****учим*****язык*****Python
# МыabcучимabcязыкabcPython
# Мы123учим123язык123Python


# Примечание 4. На самом деле, метод join() в качестве аргумента может принимать не только список, но и строку.
# Приведённый ниже код:

s = '+'.join('pygen')
print(s)
                
# выводит:
# p+y+g+e+n