print("я", "учусь", "программировать", "на", "Python")
print("\n" + "=" * 30 + "\n")
print("4", "8", "15", "16", "23", "42", sep="\n")
print(4, 8, 15, 16, 23, 42, sep="\n")
print('В тексте есть "двойные" кавычки')
print("В тексте есть 'одинарные' кавычки")
print("\n" + "=" * 30 + "\n")
print("Здравствуй, мир!")
print("\n" + "=" * 30 + "\n")
print("*\n**\n***\n****\n*****\n******\n*******")
print("\n" + "=" * 30 + "\n")
print("*", "**", "***", "****", "*****", "******", "*******", sep="\n")
print("\n" + "=" * 30 + "\n")
print(
    """*
**
***
****
*****
******
*******"""
)

